Revit 2027 API
IFCConnectedWallData.Location Property
 The location for the join.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCConnectedWallDataLocation Location { get; }
Public ReadOnly Property Location As IFCConnectedWallDataLocation
	Get
public:
property IFCConnectedWallDataLocation Location {
	IFCConnectedWallDataLocation get ();
}
member Location : IFCConnectedWallDataLocation with get
Property Value
IFCConnectedWallDataLocation
See Also
Reference
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace